examples/porousHeatTransferFoam/PCMValidations/water/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

a				0.5;
chi				0.5;
dCap                    34e-3;
KD				99173.55;//1e8;//	// 1 / k
F				127.3;//0;//	
HTcoef			3000;//2547;//1800;//16000;//

// ************************************************************************* //
